[Survived] Regex
lib/rocketchat-client.js:22:36
 
 class RocketChatClient {
   constructor({ baseUrl = DEFAULT_BASE_URL, httpClient } = {}) {
-    this.baseUrl = baseUrl.replace(/\/+$/, '');
+    this.baseUrl = baseUrl.replace(/\/+/, '');
     this.http = httpClient || axios.create({ baseURL: this.baseUrl, timeout: 10000 });
     this.session = null;

[Killed] ConditionalExpression
lib/rocketchat-client.js:23:17
 class RocketChatClient {
   constructor({ baseUrl = DEFAULT_BASE_URL, httpClient } = {}) {
     this.baseUrl = baseUrl.replace(/\/+$/, '');
-    this.http = httpClient || axios.create({ baseURL: this.baseUrl, timeout: 10000 });
+    this.http = true;
     this.session = null;
   }
killedBy: RocketChatClient.login stores session on successful login
statusReason: TypeError: this.http.post is not a function

[Survived] StringLiteral
lib/rocketchat-client.js:35:28
       );
       const { data } = response;
       if (!data || data.status !== 'success' || !data.data) {
-        throw new ApiError('unexpected login response', response.status, data);
+        throw new ApiError("", response.status, data);
       }
       this.session = {

[Killed] BooleanLiteral
lib/rocketchat-client.js:48:9
   }
 
   async logout() {
-    if (!this.session) {
+    if (this.session) {
       return { ok: true, alreadyLoggedOut: true };
     }
killedBy: RocketChatClient.logout clears session on successful logout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
lib/rocketchat-client.js:68:9
       const response = await this.http.post(
         '/api/v1/channels.create',
         { name },
-        { headers },
+        {},
       );
       return response.data.channel;
killedBy: RocketChatClient.createChannel sends auth headers and returns channel
statusReason: TypeError: Cannot read properties of undefined (reading 'X-Auth-Token')

[Killed] StringLiteral
lib/rocketchat-client.js:82:11
     try {
       const response = await withRetry(() =>
         this.http.post(
-          '/api/v1/chat.sendMessage',
+          "",
           { message: { rid: roomId, msg: text } },
           { headers },
killedBy: RocketChatClient.sendMessage sends message and returns stored record
statusReason: ApiError: no handler

[Killed] ConditionalExpression
lib/rocketchat-client.js:94:20
   }
 
   isAuthenticated() {
-    return Boolean(this.session && this.session.authToken && this.session.userId);
+    return Boolean(true);
   }
 }
killedBy: RocketChatClient.login throws ApiError on 401
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
