[Survived] ObjectLiteral
lib/rocketchat-client.js:31:41
-           this.http.post('/api/v1/login', { user: username, password }),
+           this.http.post('/api/v1/login', {}),
Tests ran:
    RocketChatClient.login stores session on successful login
    RocketChatClient.login throws ApiError on 401
    RocketChatClient.login throws ApiError when status field is not "success"

[Survived] StringLiteral
lib/rocketchat-client.js:35:28
-           throw new ApiError('unexpected login response', response.status, data);
+           throw new ApiError("", response.status, data);
Tests ran:
    RocketChatClient.login throws ApiError when status field is not "success"

[NoCoverage] BlockStatement
lib/validators.js:26:46
-     if (password.length < MIN_PASSWORD_LENGTH) {
-       throw new ValidationError('password too short', 'password');
-     }
+     if (password.length < MIN_PASSWORD_LENGTH) {}

[NoCoverage] StringLiteral
lib/validators.js:27:31
-       throw new ValidationError('password too short', 'password');
+       throw new ValidationError("", 'password');

[NoCoverage] StringLiteral
lib/validators.js:27:53
-       throw new ValidationError('password too short', 'password');
+       throw new ValidationError('password too short', "");

[Survived] StringLiteral
lib/validators.js:22:34
-     assertNonEmptyString(password, 'password');
+     assertNonEmptyString(password, "");
Tests ran:
    validateCredentials accepts valid username and password
    validateCredentials rejects empty password
    validateCredentials rejects non-string password
  and 5 more tests!

[Survived] ConditionalExpression
lib/validators.js:26:7
-     if (password.length < MIN_PASSWORD_LENGTH) {
+     if (false) {
Tests ran:
    validateCredentials accepts valid username and password
    validateCredentials accepts username exactly MAX_USERNAME_LENGTH
    RocketChatClient.login stores session on successful login
  and 2 more tests!

[Survived] EqualityOperator
lib/validators.js:26:7
-     if (password.length < MIN_PASSWORD_LENGTH) {
+     if (password.length <= MIN_PASSWORD_LENGTH) {
Tests ran:
    validateCredentials accepts valid username and password
    validateCredentials accepts username exactly MAX_USERNAME_LENGTH
    RocketChatClient.login stores session on successful login
  and 2 more tests!
