[Killed] Regex
lib/validators.js:9:30
 const MAX_MESSAGE_LENGTH = 10000;
 const MAX_CHANNEL_NAME_LENGTH = 64;
 const MIN_PASSWORD_LENGTH = 1;
-const CHANNEL_NAME_PATTERN = /^[a-z0-9._-]+$/i;
+const CHANNEL_NAME_PATTERN = /^[a-z0-9._-]+/i;
 
 function assertNonEmptyString(value, field) {
killedBy: validateChannelName rejects name with spaces
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /invalid characters/

Received function did not throw

[Killed] EqualityOperator
lib/validators.js:12:7
 const CHANNEL_NAME_PATTERN = /^[a-z0-9._-]+$/i;
 
 function assertNonEmptyString(value, field) {
-  if (typeof value !== 'string') {
+  if (typeof value === 'string') {
     throw new ValidationError(`${field} must be a string`, field);
   }
killedBy: validateCredentials accepts valid username and password
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "username must be a string"

      66 |       } else {
      67 |         stryCov_9fa48("123");
    > 68 |         throw new ValidationError(stryMutAct_9fa48("124") ? `` : (stryCov_9fa48("124"), `${field} must be a string`), field);

[Survived] StringLiteral
lib/validators.js:13:31
 
 function assertNonEmptyString(value, field) {
   if (typeof value !== 'string') {
-    throw new ValidationError(`${field} must be a string`, field);
+    throw new ValidationError(``, field);
   }
   if (value.length === 0) {

[Killed] BlockStatement
lib/validators.js:15:27
   if (typeof value !== 'string') {
     throw new ValidationError(`${field} must be a string`, field);
   }
-  if (value.length === 0) {
-    throw new ValidationError(`${field} must not be empty`, field);
-  }
+  if (value.length === 0) {}
 }
 
killedBy: validateCredentials rejects empty username
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
lib/validators.js:15:7
   if (typeof value !== 'string') {
     throw new ValidationError(`${field} must be a string`, field);
   }
-  if (value.length === 0) {
+  if (true) {
     throw new ValidationError(`${field} must not be empty`, field);
   }
killedBy: validateCredentials accepts valid username and password
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "username must not be empty"

      74 |       } else {
      75 |         stryCov_9fa48("128");
    > 76 |         throw new ValidationError(stryMutAct_9fa48("129") ? `` : (stryCov_9fa48("129"), `${field} must not be empty`), field);

[Killed] ConditionalExpression
lib/validators.js:23:7
 function validateCredentials(username, password) {
   assertNonEmptyString(username, 'username');
   assertNonEmptyString(password, 'password');
-  if (username.length > MAX_USERNAME_LENGTH) {
+  if (true) {
     throw new ValidationError('username too long', 'username');
   }
killedBy: validateCredentials accepts valid username and password
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "username too long"

      91 |       } else {
      92 |         stryCov_9fa48("137");
    > 93 |         throw new ValidationError(stryMutAct_9fa48("138") ? "" : (stryCov_9fa48("138"), 'username too long'), stryMutAct_9fa48("139") ? "" : (stryCov_9fa48("139"), 'username'));

[Survived] StringLiteral
lib/validators.js:24:52
   assertNonEmptyString(username, 'username');
   assertNonEmptyString(password, 'password');
   if (username.length > MAX_USERNAME_LENGTH) {
-    throw new ValidationError('username too long', 'username');
+    throw new ValidationError('username too long', "");
   }
   if (password.length < MIN_PASSWORD_LENGTH) {

[NoCoverage] StringLiteral
lib/validators.js:27:53
     throw new ValidationError('username too long', 'username');
   }
   if (password.length < MIN_PASSWORD_LENGTH) {
-    throw new ValidationError('password too short', 'password');
+    throw new ValidationError('password too short', "");
   }
 }

[Killed] ConditionalExpression
lib/validators.js:33:7
 
 function validateChannelName(name) {
   assertNonEmptyString(name, 'name');
-  if (name.length > MAX_CHANNEL_NAME_LENGTH) {
+  if (false) {
     throw new ValidationError('channel name too long', 'name');
   }
killedBy: validateChannelName rejects name exceeding MAX_CHANNEL_NAME_LENGTH
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /too long/

Received function did not throw

[Killed] EqualityOperator
lib/validators.js:46:7
   if (typeof text !== 'string') {
     throw new ValidationError('text must be a string', 'text');
   }
-  if (text.length === 0) {
+  if (text.length !== 0) {
     throw new ValidationError('text must not be empty', 'text');
   }
killedBy: validateMessage accepts valid message
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "text must not be empty"

      147 |       } else {
      148 |         stryCov_9fa48("174");
    > 149 |         throw new ValidationError(stryMutAct_9fa48("175") ? "" : (stryCov_9fa48("175"), 'text must not be empty'), stryMutAct_9fa48("176") ? "" : (stryCov_9fa48("176"), 'text'));

[Killed] ConditionalExpression
lib/validators.js:49:7
   if (text.length === 0) {
     throw new ValidationError('text must not be empty', 'text');
   }
-  if (text.length > MAX_MESSAGE_LENGTH) {
+  if (true) {
     throw new ValidationError('text exceeds max length', 'text');
   }
killedBy: validateMessage accepts valid message
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "text exceeds max length"

      155 |       } else {
      156 |         stryCov_9fa48("181");
    > 157 |         throw new ValidationError(stryMutAct_9fa48("182") ? "" : (stryCov_9fa48("182"), 'text exceeds max length'), stryMutAct_9fa48("183") ? "" : (stryCov_9fa48("183"), 'text'));

[Killed] ConditionalExpression
lib/validators.js:49:7
   if (text.length === 0) {
     throw new ValidationError('text must not be empty', 'text');
   }
-  if (text.length > MAX_MESSAGE_LENGTH) {
+  if (false) {
     throw new ValidationError('text exceeds max length', 'text');
   }
killedBy: validateMessage rejects message exceeding MAX_MESSAGE_LENGTH
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /exceeds max length/

Received function did not throw

[Killed] ConditionalExpression
lib/validators.js:55:7
 }
 
 function buildAuthHeaders(session) {
-  if (!session || !session.userId || !session.authToken) {
+  if (true) {
     throw new ValidationError('missing session', 'session');
   }
killedBy: buildAuthHeaders returns X-Auth-Token and X-User-Id
statusReason: ValidationError: missing session

[Killed] ObjectLiteral
lib/validators.js:64:18
   };
 }
 
-module.exports = {
-  validateCredentials,
-  validateChannelName,
-  validateMessage,
-  buildAuthHeaders,
-  CHANNEL_NAME_PATTERN,
-  MAX_USERNAME_LENGTH,
-  MAX_MESSAGE_LENGTH,
-  MAX_CHANNEL_NAME_LENGTH,
-  MIN_PASSWORD_LENGTH,
-};
+module.exports = {};
 
killedBy: validateCredentials accepts valid username and password
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "validateCredentials is not a function"

      41 | describe('validateCredentials', () => {
      42 |   test('accepts valid username and password', () => {
    > 43 |     expect(() => validateCredentials('admin', 'pw')).not.toThrow();
