[Killed] BlockStatement
lib/errors.js:21:23
 }
 
 function normalizeError(error) {
-  if (error.response) {
-    const { status, data } = error.response;
-    return new ApiError(
-      (data && data.error) || error.message,
-      status,
-      data,
-    );
-  }
+  if (error.response) {}
   return error;
 }
killedBy: normalizeError wraps axios error with response into ApiError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ApiError
Received constructor: Object

[Killed] ConditionalExpression
lib/errors.js:24:7
   if (error.response) {
     const { status, data } = error.response;
     return new ApiError(
-      (data && data.error) || error.message,
+      true,
       status,
       data,
killedBy: normalizeError wraps axios error with response into ApiError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unauthorized"
Received: "true"

[Killed] LogicalOperator
lib/errors.js:24:7
   if (error.response) {
     const { status, data } = error.response;
     return new ApiError(
-      (data && data.error) || error.message,
+      data && data.error && error.message,
       status,
       data,
killedBy: normalizeError wraps axios error with response into ApiError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unauthorized"
Received: "boom"
