[Killed] EqualityOperator
lib/retry.js:4:10
 'use strict';
 
 function isRetryableStatus(status) {
-  return status === 429 || (status >= 500 && status < 600);
+  return status !== 429 || (status >= 500 && status < 600);
 }
 
killedBy: isRetryableStatus 429 is retryable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
lib/retry.js:4:46
 'use strict';
 
 function isRetryableStatus(status) {
-  return status === 429 || (status >= 500 && status < 600);
+  return status === 429 || (status >= 500 && status <= 600);
 }
 
killedBy: isRetryableStatus 600 is not retryable (outside 5xx)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
lib/retry.js:9:25
 
 async function withRetry(fn, { retries = 2, delayMs = 100 } = {}) {
   let lastError;
-  for (let attempt = 0; attempt <= retries; attempt += 1) {
+  for (let attempt = 0; attempt > retries; attempt += 1) {
     try {
       return await fn();
killedBy: withRetry returns value on first success
statusReason: Error: thrown: undefined

[Killed] LogicalOperator
lib/retry.js:14:22
       return await fn();
     } catch (error) {
       lastError = error;
-      const status = error.response && error.response.status;
+      const status = error.response || error.response.status;
       if (!isRetryableStatus(status) || attempt === retries) {
         throw error;
killedBy: withRetry retries on 503 and eventually succeeds
statusReason: Error: thrown: Object {
  "response": Object {
    "status": 503,
  },
}

[Killed] BlockStatement
lib/retry.js:15:62
     } catch (error) {
       lastError = error;
       const status = error.response && error.response.status;
-      if (!isRetryableStatus(status) || attempt === retries) {
-        throw error;
-      }
+      if (!isRetryableStatus(status) || attempt === retries) {}
       await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
     }
killedBy: withRetry does not retry on 400
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Survived] ArithmeticOperator
lib/retry.js:18:58
       if (!isRetryableStatus(status) || attempt === retries) {
         throw error;
       }
-      await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
+      await new Promise((resolve) => setTimeout(resolve, delayMs / (attempt + 1)));
     }
   }
