[Survived] StringLiteral
lib/errors.js:6:17
-       this.name = 'ValidationError';
+       this.name = "";
Tests ran:
    validateCredentials rejects empty username
    validateCredentials rejects empty password
    validateCredentials rejects non-string username
  and 17 more tests!

[Survived] StringLiteral
lib/errors.js:14:17
-       this.name = 'ApiError';
+       this.name = "";
Tests ran:
    normalizeError wraps axios error with response into ApiError
    normalizeError falls back to message when data.error missing
    RocketChatClient.login throws ApiError on 401
  and 1 more test!

[Survived] ConditionalExpression
lib/retry.js:15:41
-         if (!isRetryableStatus(status) || attempt === retries) {
+         if (!isRetryableStatus(status) || false) {
Tests ran:
    withRetry retries on 503 and eventually succeeds
    withRetry gives up after retries exhausted
    RocketChatClient.sendMessage retries on 503 then succeeds

[Survived] ArithmeticOperator
lib/retry.js:18:58
-         await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
+         await new Promise((resolve) => setTimeout(resolve, delayMs / (attempt + 1)));
Tests ran:
    withRetry retries on 503 and eventually succeeds
    withRetry gives up after retries exhausted
    RocketChatClient.sendMessage retries on 503 then succeeds

[Survived] ArithmeticOperator
lib/retry.js:18:69
-         await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt + 1)));
+         await new Promise((resolve) => setTimeout(resolve, delayMs * (attempt - 1)));
Tests ran:
    withRetry retries on 503 and eventually succeeds
    withRetry gives up after retries exhausted
    RocketChatClient.sendMessage retries on 503 then succeeds

[NoCoverage] ObjectLiteral
lib/rocketchat-client.js:23:44
-       this.http = httpClient || axios.create({ baseURL: this.baseUrl, timeout: 10000 });
+       this.http = httpClient || axios.create({});

[NoCoverage] BlockStatement
lib/rocketchat-client.js:56:21
-       } catch (error) {
-         throw normalizeError(error);
-       }
+       } catch (error) {}

[NoCoverage] BlockStatement
lib/rocketchat-client.js:71:21
-       } catch (error) {
-         throw normalizeError(error);
-       }
+       } catch (error) {}

[NoCoverage] BlockStatement
lib/rocketchat-client.js:88:21
-       } catch (error) {
-         throw normalizeError(error);
-       }
+       } catch (error) {}

[Survived] Regex
lib/rocketchat-client.js:22:36
-       this.baseUrl = baseUrl.replace(/\/+$/, '');
+       this.baseUrl = baseUrl.replace(/\/+/, '');
Tests ran:
    RocketChatClient.login stores session on successful login
    RocketChatClient.login throws ApiError on 401
    RocketChatClient.login rejects empty credentials without calling http
  and 12 more tests!

[Survived] Regex
lib/rocketchat-client.js:22:36
-       this.baseUrl = baseUrl.replace(/\/+$/, '');
+       this.baseUrl = baseUrl.replace(/\/$/, '');
Tests ran:
    RocketChatClient.login stores session on successful login
    RocketChatClient.login throws ApiError on 401
    RocketChatClient.login rejects empty credentials without calling http
  and 12 more tests!

[Survived] StringLiteral
lib/rocketchat-client.js:22:44
-       this.baseUrl = baseUrl.replace(/\/+$/, '');
+       this.baseUrl = baseUrl.replace(/\/+$/, "Stryker was here!");
Tests ran:
    RocketChatClient.login stores session on successful login
    RocketChatClient.login throws ApiError on 401
    RocketChatClient.login rejects empty credentials without calling http
  and 12 more tests!

[Survived] LogicalOperator
lib/rocketchat-client.js:34:11
-         if (!data || data.status !== 'success' || !data.data) {
+         if ((!data || data.status !== 'success') && !data.data) {
Tests ran:
    RocketChatClient.login stores session on successful login
    RocketChatClient.login throws ApiError when status field is not "success"

[Survived] ConditionalExpression
lib/rocketchat-client.js:34:11
-         if (!data || data.status !== 'success' || !data.data) {
+         if (false || !data.data) {
Tests ran:
    RocketChatClient.login stores session on successful login
    RocketChatClient.login throws ApiError when status field is not "success"

[Survived] LogicalOperator
lib/rocketchat-client.js:34:11
-         if (!data || data.status !== 'success' || !data.data) {
+         if (!data && data.status !== 'success' || !data.data) {
Tests ran:
    RocketChatClient.login stores session on successful login
    RocketChatClient.login throws ApiError when status field is not "success"

[Survived] ConditionalExpression
lib/rocketchat-client.js:34:20
-         if (!data || data.status !== 'success' || !data.data) {
+         if (!data || false || !data.data) {
Tests ran:
    RocketChatClient.login stores session on successful login
    RocketChatClient.login throws ApiError when status field is not "success"

[Survived] ObjectLiteral
lib/rocketchat-client.js:53:50
-         await this.http.post('/api/v1/logout', {}, { headers });
+         await this.http.post('/api/v1/logout', {}, {});
Tests ran:
    RocketChatClient.logout clears session on successful logout

[Survived] BooleanLiteral
lib/rocketchat-client.js:55:20
-         return { ok: true, alreadyLoggedOut: false };
+         return { ok: false, alreadyLoggedOut: false };
Tests ran:
    RocketChatClient.logout clears session on successful logout

[Survived] ObjectLiteral
lib/rocketchat-client.js:84:11
-             { headers },
+             {},
Tests ran:
    RocketChatClient.sendMessage sends message and returns stored record
    RocketChatClient.sendMessage retries on 503 then succeeds

[Survived] StringLiteral
lib/rocketchat-client.js:18:26
-   const DEFAULT_BASE_URL = 'http://localhost:3000';
+   const DEFAULT_BASE_URL = "";
Ran all tests for this mutant.

[Survived] StringLiteral
lib/validators.js:13:31
-       throw new ValidationError(`${field} must be a string`, field);
+       throw new ValidationError(``, field);
Tests ran:
    validateCredentials rejects non-string username
    validateCredentials rejects non-string password

[Survived] StringLiteral
lib/validators.js:21:34
-     assertNonEmptyString(username, 'username');
+     assertNonEmptyString(username, "");
Tests ran:
    validateCredentials accepts valid username and password
    validateCredentials rejects empty username
    validateCredentials rejects empty password
  and 8 more tests!

[Survived] StringLiteral
lib/validators.js:24:52
-       throw new ValidationError('username too long', 'username');
+       throw new ValidationError('username too long', "");
Tests ran:
    validateCredentials rejects username longer than MAX_USERNAME_LENGTH

[Survived] StringLiteral
lib/validators.js:32:30
-     assertNonEmptyString(name, 'name');
+     assertNonEmptyString(name, "");
Tests ran:
    validateChannelName accepts valid channel name
    validateChannelName rejects empty name
    validateChannelName rejects name with spaces
  and 6 more tests!

[Survived] StringLiteral
lib/validators.js:34:56
-       throw new ValidationError('channel name too long', 'name');
+       throw new ValidationError('channel name too long', "");
Tests ran:
    validateChannelName rejects name exceeding MAX_CHANNEL_NAME_LENGTH

[Survived] StringLiteral
lib/validators.js:37:75
-       throw new ValidationError('channel name contains invalid characters', 'name');
+       throw new ValidationError('channel name contains invalid characters', "");
Tests ran:
    validateChannelName rejects name with spaces
    validateChannelName rejects name with special chars
    RocketChatClient.createChannel rejects invalid channel name without calling http

[Survived] StringLiteral
lib/validators.js:44:56
-       throw new ValidationError('text must be a string', 'text');
+       throw new ValidationError('text must be a string', "");
Tests ran:
    validateMessage rejects non-string text

[Survived] StringLiteral
lib/validators.js:47:57
-       throw new ValidationError('text must not be empty', 'text');
+       throw new ValidationError('text must not be empty', "");
Tests ran:
    validateMessage rejects empty message text
    RocketChatClient.sendMessage rejects empty message

[Survived] StringLiteral
lib/validators.js:50:58
-       throw new ValidationError('text exceeds max length', 'text');
+       throw new ValidationError('text exceeds max length', "");
Tests ran:
    validateMessage rejects message exceeding MAX_MESSAGE_LENGTH

[Survived] StringLiteral
lib/validators.js:56:50
-       throw new ValidationError('missing session', 'session');
+       throw new ValidationError('missing session', "");
Tests ran:
    buildAuthHeaders throws when session is null
    buildAuthHeaders throws when authToken missing
    buildAuthHeaders throws when userId missing
  and 1 more test!
